## Plan Result (prod-frontdoor)




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-admin-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod"
        name                                 = "sdshmcts-prod"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-toffee" -> "healthProbeSettings-vh-video-web"
            id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/backendPools/toffee"
          ~ load_balancing_name = "loadBalancingSettings-toffee" -> "loadBalancingSettings-vh-video-web"
          ~ name                = "toffee" -> "vh-video-web"

          ~ backend {
              ~ host_header = "toffee.platform.hmcts.net" -> "video-sds.hearings.reform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sds-api-mgmt" -> "healthProbeSettings-vh-admin-web"
            id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/backendPools/sds-api-mgmt"
          ~ load_balancing_name = "loadBalancingSettings-sds-api-mgmt" -> "loadBalancingSettings-vh-admin-web"
          ~ name                = "sds-api-mgmt" -> "vh-admin-web"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-sdsapimgmtprod.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com"
              ~ host_header = "sds-api-mgmt.platform.hmcts.net" -> "admin-sds.hearings.reform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-c100-application" -> "healthProbeSettings-toffee"
            id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/backendPools/c100-application"
          ~ load_balancing_name = "loadBalancingSettings-c100-application" -> "loadBalancingSettings-toffee"
          ~ name                = "c100-application" -> "toffee"

          ~ backend {
              ~ host_header = "c100-application.platform.hmcts.net" -> "toffee.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-portal" -> "healthProbeSettings-sds-api-mgmt"
            id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/backendPools/portal"
          ~ load_balancing_name = "loadBalancingSettings-portal" -> "loadBalancingSettings-sds-api-mgmt"
          ~ name                = "portal" -> "sds-api-mgmt"

          ~ backend {
              ~ address     = "pre-prod.powerappsportals.com" -> "firewall-prod-int-palo-sdsapimgmtprod.uksouth.cloudapp.azure.com"
              ~ host_header = "portal.pre-recorded-evidence.justice.gov.uk" -> "sds-api-mgmt.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-c100-application"
          + load_balancing_name = "loadBalancingSettings-c100-application"
          + name                = "c100-application"

          + backend {
              + address     = "firewall-prod-int-palo-sdsprod.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "c100-application.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-portal"
          + load_balancing_name = "loadBalancingSettings-portal"
          + name                = "portal"

          + backend {
              + address     = "pre-prod.powerappsportals.com"
              + enabled     = true
              + host_header = "portal.pre-recorded-evidence.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/healthProbeSettings/healthProbeSettings-toffee"
          ~ name                = "healthProbeSettings-toffee" -> "healthProbeSettings-vh-video-web"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/healthProbeSettings/healthProbeSettings-sds-api-mgmt"
          ~ name                = "healthProbeSettings-sds-api-mgmt" -> "healthProbeSettings-vh-admin-web"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/healthProbeSettings/healthProbeSettings-c100-application"
          ~ name                = "healthProbeSettings-c100-application" -> "healthProbeSettings-toffee"
          ~ path                = "/status" -> "/health/liveness"
            # (4 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/healthProbeSettings/healthProbeSettings-portal"
          ~ name                = "healthProbeSettings-portal" -> "healthProbeSettings-sds-api-mgmt"
          ~ path                = "/SignIn?ReturnUrl=%2F" -> "/health/liveness"
          ~ protocol            = "Https" -> "Http"
            # (3 unchanged attributes hidden)
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-c100-application"
          + path                = "/status"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-portal"
          + path                = "/SignIn?ReturnUrl=%2F"
          + probe_method        = "GET"
          + protocol            = "Https"
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/loadBalancingSettings/loadBalancingSettings-toffee"
          ~ name                            = "loadBalancingSettings-toffee" -> "loadBalancingSettings-vh-video-web"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/loadBalancingSettings/loadBalancingSettings-sds-api-mgmt"
          ~ name                            = "loadBalancingSettings-sds-api-mgmt" -> "loadBalancingSettings-vh-admin-web"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/loadBalancingSettings/loadBalancingSettings-c100-application"
          ~ name                            = "loadBalancingSettings-c100-application" -> "loadBalancingSettings-toffee"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/loadBalancingSettings/loadBalancingSettings-portal"
          ~ name                            = "loadBalancingSettings-portal" -> "loadBalancingSettings-sds-api-mgmt"
            # (3 unchanged attributes hidden)
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-c100-application"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-portal"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "toffee.platform.hmcts.net" -> "video-sds.hearings.reform.hmcts.net"
            id                                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/frontendEndpoints/toffee"
          ~ name                                    = "toffee" -> "vh-video-web"
          ~ web_application_firewall_policy_link_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeeprod" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "sds-api-mgmt.platform.hmcts.net" -> "admin-sds.hearings.reform.hmcts.net"
            id                                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/frontendEndpoints/sds-api-mgmt"
          ~ name                                    = "sds-api-mgmt" -> "vh-admin-web"
          ~ web_application_firewall_policy_link_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmtprod" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "c100-application.platform.hmcts.net" -> "toffee.platform.hmcts.net"
            id                                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/frontendEndpoints/c100-application"
          ~ name                                    = "c100-application" -> "toffee"
          ~ web_application_firewall_policy_link_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/c100applicationprod" -> "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeeprod"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "portal.pre-recorded-evidence.justice.gov.uk" -> "sds-api-mgmt.platform.hmcts.net"
            id                                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/frontendEndpoints/portal"
          ~ name                                    = "portal" -> "sds-api-mgmt"
          ~ web_application_firewall_policy_link_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/portalprod" -> "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmtprod"
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                               = "c100-application.platform.hmcts.net"
          + name                                    = "c100-application"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/c100applicationprod"
        }
      + frontend_endpoint {
          + host_name                               = "portal.pre-recorded-evidence.justice.gov.uk"
          + name                                    = "portal"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/portalprod"
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "toffee",
              + "vh-video-web",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/toffee"
          ~ name               = "toffee" -> "vh-video-web"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "toffee" -> "vh-video-web"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sds-api-mgmt",
              + "vh-admin-web",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/sds-api-mgmt"
          ~ name               = "sds-api-mgmt" -> "vh-admin-web"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "sds-api-mgmt" -> "vh-admin-web"
              ~ cache_enabled                         = false -> true
              ~ cache_query_parameter_strip_directive = "StripAll" -> "StripNone"
                # (3 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "c100-application",
              + "toffee",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/c100-application"
          ~ name               = "c100-application" -> "toffee"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "c100-application" -> "toffee"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "portal",
              + "sds-api-mgmt",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/portal"
          ~ name               = "portal" -> "sds-api-mgmt"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "portal" -> "sds-api-mgmt"
              ~ forwarding_protocol                   = "HttpsOnly" -> "HttpOnly"
                # (4 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "dts-legacy-apps---certificatedbailiffs",
              + "c100-application",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/dts-legacy-apps---certificatedbailiffsHttpsRedirect"
          ~ name               = "dts-legacy-apps---certificatedbailiffsHttpsRedirect" -> "c100-application"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "c100-application"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "dts-legacy-apps---civilappeals-casetracker",
              + "portal",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/dts-legacy-apps---civilappeals-casetrackerHttpsRedirect"
          ~ name               = "dts-legacy-apps---civilappeals-casetrackerHttpsRedirect" -> "portal"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "portal"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpsOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dts-legacy-apps---courtfines",
              + "dts-legacy-apps---certificatedbailiffs",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/dts-legacy-apps---courtfinesHttpsRedirect"
          ~ name               = "dts-legacy-apps---courtfinesHttpsRedirect" -> "dts-legacy-apps---certificatedbailiffsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dts-legacy-apps---immigration-appeals-iacfees",
              + "dts-legacy-apps---civilappeals-casetracker",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/dts-legacy-apps---immigration-appeals-iacfeesHttpsRedirect"
          ~ name               = "dts-legacy-apps---immigration-appeals-iacfeesHttpsRedirect" -> "dts-legacy-apps---civilappeals-casetrackerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dts-legacy-apps---redirect-service",
              + "dts-legacy-apps---courtfines",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/dts-legacy-apps---redirect-serviceHttpsRedirect"
          ~ name               = "dts-legacy-apps---redirect-serviceHttpsRedirect" -> "dts-legacy-apps---courtfinesHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dts-legacy-apps---utiac",
              + "dts-legacy-apps---immigration-appeals-iacfees",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/dts-legacy-apps---utiacHttpsRedirect"
          ~ name               = "dts-legacy-apps---utiacHttpsRedirect" -> "dts-legacy-apps---immigration-appeals-iacfeesHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "casetracker",
              + "dts-legacy-apps---redirect-service",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/casetrackerHttpsRedirect"
          ~ name               = "casetrackerHttpsRedirect" -> "dts-legacy-apps---redirect-serviceHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "certificatedbailiffs",
              + "dts-legacy-apps---utiac",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/certificatedbailiffsHttpsRedirect"
          ~ name               = "certificatedbailiffsHttpsRedirect" -> "dts-legacy-apps---utiacHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "courtfines",
              + "casetracker",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/courtfinesHttpsRedirect"
          ~ name               = "courtfinesHttpsRedirect" -> "casetrackerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "immigrationappealsonline",
              + "certificatedbailiffs",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/immigrationappealsonlineHttpsRedirect"
          ~ name               = "immigrationappealsonlineHttpsRedirect" -> "certificatedbailiffsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "tribunalsdecisions",
              + "courtfines",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/tribunalsdecisionsHttpsRedirect"
          ~ name               = "tribunalsdecisionsHttpsRedirect" -> "courtfinesHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-land-reg-division",
              + "immigrationappealsonline",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-land-reg-divisionHttpsRedirect"
          ~ name               = "trib-land-reg-divisionHttpsRedirect" -> "immigrationappealsonlineHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-immigration-svcs",
              + "tribunalsdecisions",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-immigration-svcsHttpsRedirect"
          ~ name               = "trib-immigration-svcsHttpsRedirect" -> "tribunalsdecisionsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-info-rights",
              + "trib-land-reg-division",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-info-rightsHttpsRedirect"
          ~ name               = "trib-info-rightsHttpsRedirect" -> "trib-land-reg-divisionHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-admin-appeals",
              + "trib-immigration-svcs",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-admin-appealsHttpsRedirect"
          ~ name               = "trib-admin-appealsHttpsRedirect" -> "trib-immigration-svcsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-care-standards",
              + "trib-info-rights",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-care-standardsHttpsRedirect"
          ~ name               = "trib-care-standardsHttpsRedirect" -> "trib-info-rightsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-lands-chamber",
              + "trib-admin-appeals",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-lands-chamberHttpsRedirect"
          ~ name               = "trib-lands-chamberHttpsRedirect" -> "trib-admin-appealsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-finance-tax",
              + "trib-care-standards",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-finance-taxHttpsRedirect"
          ~ name               = "trib-finance-taxHttpsRedirect" -> "trib-care-standardsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-employment-appeals",
              + "trib-lands-chamber",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-employment-appealsHttpsRedirect"
          ~ name               = "trib-employment-appealsHttpsRedirect" -> "trib-lands-chamberHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-tansport-appeals",
              + "trib-finance-tax",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-tansport-appealsHttpsRedirect"
          ~ name               = "trib-tansport-appealsHttpsRedirect" -> "trib-finance-taxHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "trib-cicap",
              + "trib-employment-appeals",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/trib-cicapHttpsRedirect"
          ~ name               = "trib-cicapHttpsRedirect" -> "trib-employment-appealsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "jd-bureau",
              + "trib-tansport-appeals",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/jd-bureauHttpsRedirect"
          ~ name               = "jd-bureauHttpsRedirect" -> "trib-tansport-appealsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "jd-reply-jury-summons",
              + "trib-cicap",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/jd-reply-jury-summonsHttpsRedirect"
          ~ name               = "jd-reply-jury-summonsHttpsRedirect" -> "trib-cicapHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pip-frontend",
              + "jd-bureau",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/pip-frontendHttpsRedirect"
          ~ name               = "pip-frontendHttpsRedirect" -> "jd-bureauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "court-tribunal-hearings",
              + "jd-reply-jury-summons",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/court-tribunal-hearingsHttpsRedirect"
          ~ name               = "court-tribunal-hearingsHttpsRedirect" -> "jd-reply-jury-summonsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "court-tribunal-hearings-b2c-sign-in",
              + "pip-frontend",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/court-tribunal-hearings-b2c-sign-inHttpsRedirect"
          ~ name               = "court-tribunal-hearings-b2c-sign-inHttpsRedirect" -> "pip-frontendHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "court-tribunal-hearings-b2c-staff",
              + "court-tribunal-hearings",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/court-tribunal-hearings-b2c-staffHttpsRedirect"
          ~ name               = "court-tribunal-hearings-b2c-staffHttpsRedirect" -> "court-tribunal-hearingsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "toffee",
              + "court-tribunal-hearings-b2c-sign-in",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/toffeeHttpsRedirect"
          ~ name               = "toffeeHttpsRedirect" -> "court-tribunal-hearings-b2c-sign-inHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sds-api-mgmt",
              + "court-tribunal-hearings-b2c-staff",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/sds-api-mgmtHttpsRedirect"
          ~ name               = "sds-api-mgmtHttpsRedirect" -> "court-tribunal-hearings-b2c-staffHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "c100-application",
              + "vh-video-web",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/c100-applicationHttpsRedirect"
          ~ name               = "c100-applicationHttpsRedirect" -> "vh-video-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "portal",
              + "vh-admin-web",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/portalHttpsRedirect"
          ~ name               = "portalHttpsRedirect" -> "vh-admin-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "toffee",
            ]
          + name               = "toffeeHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sds-api-mgmt",
            ]
          + name               = "sds-api-mgmtHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "c100-application",
            ]
          + name               = "c100-applicationHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "portal",
            ]
          + name               = "portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (142 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/frontendEndpoints/vh-admin-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-video-web"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/frontendEndpoints/vh-video-web"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhadminwebprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhvideowebprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] has been deleted
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [] -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhadminwebprod" -> null
      - location                          = "global" -> null
      - mode                              = "Prevention" -> null
      - name                              = "vhadminwebprod" -> null
      - resource_group_name               = "lz-prod-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null

          - exclusion {
              - match_variable = "QueryStringArgNames" -> null
              - operator       = "Equals" -> null
              - selector       = "code" -> null
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] has been deleted
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [] -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebprod" -> null
      - location                          = "global" -> null
      - mode                              = "Prevention" -> null
      - name                              = "vhvideowebprod" -> null
      - resource_group_name               = "lz-prod-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null

          - exclusion {
              - match_variable = "QueryStringArgNames" -> null
              - operator       = "Equals" -> null
              - selector       = "code" -> null
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":415,"Program":"tfcmt","SHA1":"","Target":"prod-frontdoor","Vars":{}} -->